[Killed] BlockStatement
nodebb-plugin-endorse-posts/library.js:10:33
 const Endorse = {};
 
 // helpers
-async function assertStaff(uid) {
-	if (!uid) { return false; }
-	const isAdmin = await user.isAdministrator(uid);
-	if (isAdmin) { return true; }
-	const isGM = await user.isGlobalModerator(uid);
-	return !!isGM;
-}
+async function assertStaff(uid) {}
 
 // expose boolean on single post payloads
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected 200 "OK", got 403 "Forbidden"

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:11:6
 
 // helpers
 async function assertStaff(uid) {
-	if (!uid) { return false; }
+	if (true) { return false; }
 	const isAdmin = await user.isAdministrator(uid);
 	if (isAdmin) { return true; }
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected 200 "OK", got 403 "Forbidden"

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:11:6
 
 // helpers
 async function assertStaff(uid) {
-	if (!uid) { return false; }
+	if (uid) { return false; }
 	const isAdmin = await user.isAdministrator(uid);
 	if (isAdmin) { return true; }
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected 200 "OK", got 403 "Forbidden"

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:13:6
 async function assertStaff(uid) {
 	if (!uid) { return false; }
 	const isAdmin = await user.isAdministrator(uid);
-	if (isAdmin) { return true; }
+	if (true) { return true; }
 	const isGM = await user.isGlobalModerator(uid);
 	return !!isGM;
killedBy: Endorse API routes returns 403 for non-staff
statusReason: expected 403 "Forbidden", got 200 "OK"

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:13:24
 async function assertStaff(uid) {
 	if (!uid) { return false; }
 	const isAdmin = await user.isAdministrator(uid);
-	if (isAdmin) { return true; }
+	if (isAdmin) { return false; }
 	const isGM = await user.isGlobalModerator(uid);
 	return !!isGM;
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected 200 "OK", got 403 "Forbidden"

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:15:10
 	const isAdmin = await user.isAdministrator(uid);
 	if (isAdmin) { return true; }
 	const isGM = await user.isGlobalModerator(uid);
-	return !!isGM;
+	return !isGM;
 }
 
killedBy: Endorse API routes returns 403 for non-staff
statusReason: expected 403 "Forbidden", got 200 "OK"

[Killed] BlockStatement
nodebb-plugin-endorse-posts/library.js:19:44
 }
 
 // expose boolean on single post payloads
-Endorse.decoratePost = async (hookData) => {
-	const p = hookData && hookData.post;
-	if (!p || !p.pid) { return hookData; }
-	const v = await db.getObjectField('post:' + p.pid, 'isEndorsed');
-	p.isEndorsed = (v === '1');
-	return hookData;
-};
+Endorse.decoratePost = async (hookData) => {};
 
 // expose boolean on arrays of posts
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePost sets post.isEndorsed = true when db value is "1"
statusReason: Cannot read properties of undefined (reading 'post')

[Killed] LogicalOperator
nodebb-plugin-endorse-posts/library.js:20:12
 
 // expose boolean on single post payloads
 Endorse.decoratePost = async (hookData) => {
-	const p = hookData && hookData.post;
+	const p = hookData || hookData.post;
 	if (!p || !p.pid) { return hookData; }
 	const v = await db.getObjectField('post:' + p.pid, 'isEndorsed');
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePost sets post.isEndorsed = true when db value is "1"
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:20:12
 
 // expose boolean on single post payloads
 Endorse.decoratePost = async (hookData) => {
-	const p = hookData && hookData.post;
+	const p = false;
 	if (!p || !p.pid) { return hookData; }
 	const v = await db.getObjectField('post:' + p.pid, 'isEndorsed');
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePost sets post.isEndorsed = true when db value is "1"
statusReason: expected undefined to equal true

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:21:12
 // expose boolean on single post payloads
 Endorse.decoratePost = async (hookData) => {
 	const p = hookData && hookData.post;
-	if (!p || !p.pid) { return hookData; }
+	if (!p || p.pid) { return hookData; }
 	const v = await db.getObjectField('post:' + p.pid, 'isEndorsed');
 	p.isEndorsed = (v === '1');
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePost sets post.isEndorsed = true when db value is "1"
statusReason: expected undefined to equal true

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:21:6
 // expose boolean on single post payloads
 Endorse.decoratePost = async (hookData) => {
 	const p = hookData && hookData.post;
-	if (!p || !p.pid) { return hookData; }
+	if (p || !p.pid) { return hookData; }
 	const v = await db.getObjectField('post:' + p.pid, 'isEndorsed');
 	p.isEndorsed = (v === '1');
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePost sets post.isEndorsed = true when db value is "1"
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:23:18
 	const p = hookData && hookData.post;
 	if (!p || !p.pid) { return hookData; }
 	const v = await db.getObjectField('post:' + p.pid, 'isEndorsed');
-	p.isEndorsed = (v === '1');
+	p.isEndorsed = (false);
 	return hookData;
 };
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePost sets post.isEndorsed = true when db value is "1"
statusReason: expected false to equal true

[Killed] EqualityOperator
nodebb-plugin-endorse-posts/library.js:23:18
 	const p = hookData && hookData.post;
 	if (!p || !p.pid) { return hookData; }
 	const v = await db.getObjectField('post:' + p.pid, 'isEndorsed');
-	p.isEndorsed = (v === '1');
+	p.isEndorsed = (v !== '1');
 	return hookData;
 };
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePost sets post.isEndorsed = true when db value is "1"
statusReason: expected false to equal true

[Killed] BlockStatement
nodebb-plugin-endorse-posts/library.js:28:45
 };
 
 // expose boolean on arrays of posts
-Endorse.decoratePosts = async (hookData) => {
-	const arr = hookData && hookData.posts;
-	if (!Array.isArray(arr) || !arr.length) { return hookData; }
-	const vals = await Promise.all(arr.map(function (p) {
-		return db.getObjectField('post:' + p.pid, 'isEndorsed');
-	}));
-	arr.forEach(function (p, i) {
-		p.isEndorsed = (vals[i] === '1');
-	});
-	return hookData;
-};
+Endorse.decoratePosts = async (hookData) => {};
 
 Endorse.init = async function (params) {
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: Cannot read properties of undefined (reading 'posts')

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:29:14
 
 // expose boolean on arrays of posts
 Endorse.decoratePosts = async (hookData) => {
-	const arr = hookData && hookData.posts;
+	const arr = false;
 	if (!Array.isArray(arr) || !arr.length) { return hookData; }
 	const vals = await Promise.all(arr.map(function (p) {
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: expected undefined to equal true

[Killed] LogicalOperator
nodebb-plugin-endorse-posts/library.js:29:14
 
 // expose boolean on arrays of posts
 Endorse.decoratePosts = async (hookData) => {
-	const arr = hookData && hookData.posts;
+	const arr = hookData || hookData.posts;
 	if (!Array.isArray(arr) || !arr.length) { return hookData; }
 	const vals = await Promise.all(arr.map(function (p) {
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: expected undefined to equal true

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:30:6
 // expose boolean on arrays of posts
 Endorse.decoratePosts = async (hookData) => {
 	const arr = hookData && hookData.posts;
-	if (!Array.isArray(arr) || !arr.length) { return hookData; }
+	if (Array.isArray(arr) || !arr.length) { return hookData; }
 	const vals = await Promise.all(arr.map(function (p) {
 		return db.getObjectField('post:' + p.pid, 'isEndorsed');
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: expected undefined to equal true

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:30:29
 // expose boolean on arrays of posts
 Endorse.decoratePosts = async (hookData) => {
 	const arr = hookData && hookData.posts;
-	if (!Array.isArray(arr) || !arr.length) { return hookData; }
+	if (!Array.isArray(arr) || arr.length) { return hookData; }
 	const vals = await Promise.all(arr.map(function (p) {
 		return db.getObjectField('post:' + p.pid, 'isEndorsed');
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: expected undefined to equal true

[Killed] BlockStatement
nodebb-plugin-endorse-posts/library.js:31:54
 Endorse.decoratePosts = async (hookData) => {
 	const arr = hookData && hookData.posts;
 	if (!Array.isArray(arr) || !arr.length) { return hookData; }
-	const vals = await Promise.all(arr.map(function (p) {
-		return db.getObjectField('post:' + p.pid, 'isEndorsed');
-	}));
+	const vals = await Promise.all(arr.map(function (p) {}));
 	arr.forEach(function (p, i) {
 		p.isEndorsed = (vals[i] === '1');
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: expected false to equal true

[Survived] StringLiteral
nodebb-plugin-endorse-posts/library.js:32:45
 	const arr = hookData && hookData.posts;
 	if (!Array.isArray(arr) || !arr.length) { return hookData; }
 	const vals = await Promise.all(arr.map(function (p) {
-		return db.getObjectField('post:' + p.pid, 'isEndorsed');
+		return db.getObjectField('post:' + p.pid, "");
 	}));
 	arr.forEach(function (p, i) {

[Killed] BlockStatement
nodebb-plugin-endorse-posts/library.js:34:30
 	const vals = await Promise.all(arr.map(function (p) {
 		return db.getObjectField('post:' + p.pid, 'isEndorsed');
 	}));
-	arr.forEach(function (p, i) {
-		p.isEndorsed = (vals[i] === '1');
-	});
+	arr.forEach(function (p, i) {});
 	return hookData;
 };
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:35:19
 		return db.getObjectField('post:' + p.pid, 'isEndorsed');
 	}));
 	arr.forEach(function (p, i) {
-		p.isEndorsed = (vals[i] === '1');
+		p.isEndorsed = (true);
 	});
 	return hookData;
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: expected true to equal false

[Killed] EqualityOperator
nodebb-plugin-endorse-posts/library.js:35:19
 		return db.getObjectField('post:' + p.pid, 'isEndorsed');
 	}));
 	arr.forEach(function (p, i) {
-		p.isEndorsed = (vals[i] === '1');
+		p.isEndorsed = (vals[i] !== '1');
 	});
 	return hookData;
killedBy: Decorators (filter:post.get / filter:posts.get) decoratePosts maps array of posts
statusReason: expected false to equal true

[Timeout] BlockStatement
nodebb-plugin-endorse-posts/library.js:43:42
 Endorse.init = async function (params) {
 	const router = params.router;
 
-	async function endorseHandler(req, res) {
-		const uid = req.uid;
-		const ok = await assertStaff(uid);
-		if (!ok) {
-			return res.status(403).json({ error: 'forbidden' });
-		}
-
-		const pid = parseInt(req.params.pid, 10);
-		const post = await posts.getPostData(pid);
-		if (!post || !post.pid) {
-			return res.status(404).json({ error: 'post-not-found' });
-		}
-
-		if (req.method === 'POST') {
-			await db.setObjectField('post:' + pid, 'isEndorsed', '1');
-			return res.json({ pid: pid, isEndorsed: true });
-		}
-
-		await db.deleteObjectField('post:' + pid, 'isEndorsed');
-		return res.json({ pid: pid, isEndorsed: false });
-	}
+	async function endorseHandler(req, res) {}
 
 	// mount on both /api and /api/v3

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:46:7
 	async function endorseHandler(req, res) {
 		const uid = req.uid;
 		const ok = await assertStaff(uid);
-		if (!ok) {
+		if (ok) {
 			return res.status(403).json({ error: 'forbidden' });
 		}
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected 200 "OK", got 403 "Forbidden"

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:46:7
 	async function endorseHandler(req, res) {
 		const uid = req.uid;
 		const ok = await assertStaff(uid);
-		if (!ok) {
+		if (false) {
 			return res.status(403).json({ error: 'forbidden' });
 		}
killedBy: Endorse API routes returns 403 for non-staff
statusReason: expected 403 "Forbidden", got 200 "OK"

[Survived] ObjectLiteral
nodebb-plugin-endorse-posts/library.js:47:32
 		const uid = req.uid;
 		const ok = await assertStaff(uid);
 		if (!ok) {
-			return res.status(403).json({ error: 'forbidden' });
+			return res.status(403).json({});
 		}
 

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:52:7
 
 		const pid = parseInt(req.params.pid, 10);
 		const post = await posts.getPostData(pid);
-		if (!post || !post.pid) {
+		if (true) {
 			return res.status(404).json({ error: 'post-not-found' });
 		}
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected 200 "OK", got 404 "Not Found"

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:52:7
 
 		const pid = parseInt(req.params.pid, 10);
 		const post = await posts.getPostData(pid);
-		if (!post || !post.pid) {
+		if (false) {
 			return res.status(404).json({ error: 'post-not-found' });
 		}
killedBy: Endorse API routes returns 404 for unknown post
statusReason: expected 404 "Not Found", got 200 "OK"

[Killed] ConditionalExpression
nodebb-plugin-endorse-posts/library.js:56:7
 			return res.status(404).json({ error: 'post-not-found' });
 		}
 
-		if (req.method === 'POST') {
+		if (true) {
 			await db.setObjectField('post:' + pid, 'isEndorsed', '1');
 			return res.json({ pid: pid, isEndorsed: true });
killedBy: Endorse API routes DELETE /api/v3/posts/:pid/endorse un-endorses when staff
statusReason: expected { pid: 42, isEndorsed: true } to deeply equal { pid: 42, isEndorsed: false }

[Killed] BlockStatement
nodebb-plugin-endorse-posts/library.js:56:30
 			return res.status(404).json({ error: 'post-not-found' });
 		}
 
-		if (req.method === 'POST') {
-			await db.setObjectField('post:' + pid, 'isEndorsed', '1');
-			return res.json({ pid: pid, isEndorsed: true });
-		}
+		if (req.method === 'POST') {}
 
 		await db.deleteObjectField('post:' + pid, 'isEndorsed');
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected { pid: 42, isEndorsed: false } to deeply equal { pid: 42, isEndorsed: true }

[Killed] StringLiteral
nodebb-plugin-endorse-posts/library.js:57:28
 		}
 
 		if (req.method === 'POST') {
-			await db.setObjectField('post:' + pid, 'isEndorsed', '1');
+			await db.setObjectField("" + pid, 'isEndorsed', '1');
 			return res.json({ pid: pid, isEndorsed: true });
 		}
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected false to equal true

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:58:44
 
 		if (req.method === 'POST') {
 			await db.setObjectField('post:' + pid, 'isEndorsed', '1');
-			return res.json({ pid: pid, isEndorsed: true });
+			return res.json({ pid: pid, isEndorsed: false });
 		}
 
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected { pid: 42, isEndorsed: false } to deeply equal { pid: 42, isEndorsed: true }

[Killed] ObjectLiteral
nodebb-plugin-endorse-posts/library.js:58:20
 
 		if (req.method === 'POST') {
 			await db.setObjectField('post:' + pid, 'isEndorsed', '1');
-			return res.json({ pid: pid, isEndorsed: true });
+			return res.json({});
 		}
 
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected {} to deeply equal { pid: 42, isEndorsed: true }

[Killed] StringLiteral
nodebb-plugin-endorse-posts/library.js:61:45
 			return res.json({ pid: pid, isEndorsed: true });
 		}
 
-		await db.deleteObjectField('post:' + pid, 'isEndorsed');
+		await db.deleteObjectField('post:' + pid, "");
 		return res.json({ pid: pid, isEndorsed: false });
 	}
killedBy: Endorse API routes DELETE /api/v3/posts/:pid/endorse un-endorses when staff
statusReason: expected false to equal true

[Killed] BooleanLiteral
nodebb-plugin-endorse-posts/library.js:62:43
 		}
 
 		await db.deleteObjectField('post:' + pid, 'isEndorsed');
-		return res.json({ pid: pid, isEndorsed: false });
+		return res.json({ pid: pid, isEndorsed: true });
 	}
 
killedBy: Endorse API routes DELETE /api/v3/posts/:pid/endorse un-endorses when staff
statusReason: expected { pid: 42, isEndorsed: true } to deeply equal { pid: 42, isEndorsed: false }

[Killed] ObjectLiteral
nodebb-plugin-endorse-posts/library.js:62:19
 		}
 
 		await db.deleteObjectField('post:' + pid, 'isEndorsed');
-		return res.json({ pid: pid, isEndorsed: false });
+		return res.json({});
 	}
 
killedBy: Endorse API routes DELETE /api/v3/posts/:pid/endorse un-endorses when staff
statusReason: expected {} to deeply equal { pid: 42, isEndorsed: false }

[Killed] StringLiteral
nodebb-plugin-endorse-posts/library.js:66:14
 	}
 
 	// mount on both /api and /api/v3
-	router.post('/api/posts/:pid/endorse', endorseHandler);
+	router.post("", endorseHandler);
 	router.delete('/api/posts/:pid/endorse', endorseHandler);
 	router.post('/api/v3/posts/:pid/endorse', endorseHandler);
killedBy: Endorse API routes routes also mounted under /api
statusReason: expected 200 "OK", got 404 "Not Found"

[Killed] StringLiteral
nodebb-plugin-endorse-posts/library.js:68:14
 	// mount on both /api and /api/v3
 	router.post('/api/posts/:pid/endorse', endorseHandler);
 	router.delete('/api/posts/:pid/endorse', endorseHandler);
-	router.post('/api/v3/posts/:pid/endorse', endorseHandler);
+	router.post("", endorseHandler);
 	router.delete('/api/v3/posts/:pid/endorse', endorseHandler);
 };
killedBy: Endorse API routes POST /api/v3/posts/:pid/endorse endorses when staff
statusReason: expected 200 "OK", got 404 "Not Found"
