[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:12:20
  */
 
 // -------- helpers ----------
-function isStaff() {
-  const byUser = !!(app?.user && (app.user.isAdmin || app.user.isGlobalModerator));
-  const byBody = $('body').hasClass('admin') || $('body').hasClass('global-mod');
-  return byUser || byBody;
-}
+function isStaff() {}
 
 function getPosts(payload) {

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:13:35
 
 // -------- helpers ----------
 function isStaff() {
-  const byUser = !!(app?.user && (app.user.isAdmin || app.user.isGlobalModerator));
+  const byUser = !!(app?.user && (true));
   const byBody = $('body').hasClass('admin') || $('body').hasClass('global-mod');
   return byUser || byBody;

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:13:18
 
 // -------- helpers ----------
 function isStaff() {
-  const byUser = !!(app?.user && (app.user.isAdmin || app.user.isGlobalModerator));
+  const byUser = !(app?.user && (app.user.isAdmin || app.user.isGlobalModerator));
   const byBody = $('body').hasClass('admin') || $('body').hasClass('global-mod');
   return byUser || byBody;

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:14:18
 // -------- helpers ----------
 function isStaff() {
   const byUser = !!(app?.user && (app.user.isAdmin || app.user.isGlobalModerator));
-  const byBody = $('body').hasClass('admin') || $('body').hasClass('global-mod');
+  const byBody = true;
   return byUser || byBody;
 }

[NoCoverage] LogicalOperator
nodebb-plugin-endorse-posts/static/lib/endorse.js:14:18
 // -------- helpers ----------
 function isStaff() {
   const byUser = !!(app?.user && (app.user.isAdmin || app.user.isGlobalModerator));
-  const byBody = $('body').hasClass('admin') || $('body').hasClass('global-mod');
+  const byBody = $('body').hasClass('admin') && $('body').hasClass('global-mod');
   return byUser || byBody;
 }

[NoCoverage] LogicalOperator
nodebb-plugin-endorse-posts/static/lib/endorse.js:15:10
 function isStaff() {
   const byUser = !!(app?.user && (app.user.isAdmin || app.user.isGlobalModerator));
   const byBody = $('body').hasClass('admin') || $('body').hasClass('global-mod');
-  return byUser || byBody;
+  return byUser && byBody;
 }
 

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:15:10
 function isStaff() {
   const byUser = !!(app?.user && (app.user.isAdmin || app.user.isGlobalModerator));
   const byBody = $('body').hasClass('admin') || $('body').hasClass('global-mod');
-  return byUser || byBody;
+  return false;
 }
 

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:18:28
   return byUser || byBody;
 }
 
-function getPosts(payload) {
-  if (Array.isArray(payload?.posts)) return payload.posts;
-  if (Array.isArray(ajaxify?.data?.posts)) return ajaxify.data.posts;
-  return [];
-}
+function getPosts(payload) {}
 
 function setPostEndorsedClass($post, on) {

[NoCoverage] OptionalChaining
nodebb-plugin-endorse-posts/static/lib/endorse.js:19:21
 }
 
 function getPosts(payload) {
-  if (Array.isArray(payload?.posts)) return payload.posts;
+  if (Array.isArray(payload.posts)) return payload.posts;
   if (Array.isArray(ajaxify?.data?.posts)) return ajaxify.data.posts;
   return [];

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:19:7
 }
 
 function getPosts(payload) {
-  if (Array.isArray(payload?.posts)) return payload.posts;
+  if (true) return payload.posts;
   if (Array.isArray(ajaxify?.data?.posts)) return ajaxify.data.posts;
   return [];

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:20:7
 
 function getPosts(payload) {
   if (Array.isArray(payload?.posts)) return payload.posts;
-  if (Array.isArray(ajaxify?.data?.posts)) return ajaxify.data.posts;
+  if (false) return ajaxify.data.posts;
   return [];
 }

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:20:7
 
 function getPosts(payload) {
   if (Array.isArray(payload?.posts)) return payload.posts;
-  if (Array.isArray(ajaxify?.data?.posts)) return ajaxify.data.posts;
+  if (true) return ajaxify.data.posts;
   return [];
 }

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:24:42
   return [];
 }
 
-function setPostEndorsedClass($post, on) {
-  $post.toggleClass('endorsed', on);
-}
+function setPostEndorsedClass($post, on) {}
 
 function upsertBadge($post, on) {

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:28:33
   $post.toggleClass('endorsed', on);
 }
 
-function upsertBadge($post, on) {
-  let $b = $post.find('.endorse-badge');
-  if (!$b.length) {
-    $b = $('<span class="endorse-badge" aria-label="Endorsed">Endorsed</span>');
-    // Prefer header area; fall back to content
-    $post.find('.post-header, .content').first().prepend($b);
-  }
-  $b.toggleClass('is-on', on).toggle(on);
-  setPostEndorsedClass($post, on);   // <-- ensure container highlight toggles too
-}
+function upsertBadge($post, on) {}
 
 // -------- DOM targets ----------

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:29:23
 }
 
 function upsertBadge($post, on) {
-  let $b = $post.find('.endorse-badge');
+  let $b = $post.find("");
   if (!$b.length) {
     $b = $('<span class="endorse-badge" aria-label="Endorsed">Endorsed</span>');

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:30:19
 
 function upsertBadge($post, on) {
   let $b = $post.find('.endorse-badge');
-  if (!$b.length) {
-    $b = $('<span class="endorse-badge" aria-label="Endorsed">Endorsed</span>');
-    // Prefer header area; fall back to content
-    $post.find('.post-header, .content').first().prepend($b);
-  }
+  if (!$b.length) {}
   $b.toggleClass('is-on', on).toggle(on);
   setPostEndorsedClass($post, on);   // <-- ensure container highlight toggles too

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:30:7
 
 function upsertBadge($post, on) {
   let $b = $post.find('.endorse-badge');
-  if (!$b.length) {
+  if (false) {
     $b = $('<span class="endorse-badge" aria-label="Endorsed">Endorsed</span>');
     // Prefer header area; fall back to content

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:31:12
 function upsertBadge($post, on) {
   let $b = $post.find('.endorse-badge');
   if (!$b.length) {
-    $b = $('<span class="endorse-badge" aria-label="Endorsed">Endorsed</span>');
+    $b = $("");
     // Prefer header area; fall back to content
     $post.find('.post-header, .content').first().prepend($b);

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:40:34
 }
 
 // -------- DOM targets ----------
-function findDropdownMenu($post) {
-  return $post.find(
-    '[component="post/tools"] .dropdown-menu,' +
-    '[component="post/menu"] .dropdown-menu,' +
-    '.post-tools .dropdown-menu,' +
-    '.dropdown-menu[role="menu"]'
-  ).first();
-}
+function findDropdownMenu($post) {}
 
 function findInlineHost($post) {

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:42:5
 // -------- DOM targets ----------
 function findDropdownMenu($post) {
   return $post.find(
-    '[component="post/tools"] .dropdown-menu,' +
+    "" +
     '[component="post/menu"] .dropdown-menu,' +
     '.post-tools .dropdown-menu,' +

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:43:5
 function findDropdownMenu($post) {
   return $post.find(
     '[component="post/tools"] .dropdown-menu,' +
-    '[component="post/menu"] .dropdown-menu,' +
+    "" +
     '.post-tools .dropdown-menu,' +
     '.dropdown-menu[role="menu"]'

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:49:32
   ).first();
 }
 
-function findInlineHost($post) {
-  return $post.find(
-    '[component="post/actions"],' +
-    '[component="post/footer"],' +
-    '.post-tools,' +
-    '.post-footer,' +
-    '.content'
-  ).first();
-}
+function findInlineHost($post) {}
 
 // -------- UI injection ----------

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:60:47
 }
 
 // -------- UI injection ----------
-function injectIntoDropdown($post, pid, isOn) {
-  const $menu = findDropdownMenu($post);
-  if (!$menu.length) return false;
-
-  let $item = $menu.find('.endorse-toggle');
-  if (!$item.length) {
-    if (!$menu.find('.endorse-divider').length) {
-      $('<div class="dropdown-divider endorse-divider"></div>').appendTo($menu);
-    }
-    $item = $('<a class="dropdown-item endorse-toggle" href="#"></a>').appendTo($menu);
-    $item.on('click', (e) => {
-      e.preventDefault();
-      toggle(pid, $post);
-      $menu.closest('.dropdown').removeClass('show').find('.dropdown-menu').removeClass('show');
-    });
-  }
-  $item.text(isOn ? 'Un-endorse' : 'Endorse');
-  return true;
-}
+function injectIntoDropdown($post, pid, isOn) {}
 
 function injectInlineCTA($post, pid, isOn) {

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:62:7
 // -------- UI injection ----------
 function injectIntoDropdown($post, pid, isOn) {
   const $menu = findDropdownMenu($post);
-  if (!$menu.length) return false;
+  if ($menu.length) return false;
 
   let $item = $menu.find('.endorse-toggle');

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:62:29
 // -------- UI injection ----------
 function injectIntoDropdown($post, pid, isOn) {
   const $menu = findDropdownMenu($post);
-  if (!$menu.length) return false;
+  if (!$menu.length) return true;
 
   let $item = $menu.find('.endorse-toggle');

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:64:26
   const $menu = findDropdownMenu($post);
   if (!$menu.length) return false;
 
-  let $item = $menu.find('.endorse-toggle');
+  let $item = $menu.find("");
   if (!$item.length) {
     if (!$menu.find('.endorse-divider').length) {

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:65:22
   if (!$menu.length) return false;
 
   let $item = $menu.find('.endorse-toggle');
-  if (!$item.length) {
-    if (!$menu.find('.endorse-divider').length) {
-      $('<div class="dropdown-divider endorse-divider"></div>').appendTo($menu);
-    }
-    $item = $('<a class="dropdown-item endorse-toggle" href="#"></a>').appendTo($menu);
-    $item.on('click', (e) => {
-      e.preventDefault();
-      toggle(pid, $post);
-      $menu.closest('.dropdown').removeClass('show').find('.dropdown-menu').removeClass('show');
-    });
-  }
+  if (!$item.length) {}
   $item.text(isOn ? 'Un-endorse' : 'Endorse');
   return true;

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:65:7
   if (!$menu.length) return false;
 
   let $item = $menu.find('.endorse-toggle');
-  if (!$item.length) {
+  if (true) {
     if (!$menu.find('.endorse-divider').length) {
       $('<div class="dropdown-divider endorse-divider"></div>').appendTo($menu);

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:66:9
 
   let $item = $menu.find('.endorse-toggle');
   if (!$item.length) {
-    if (!$menu.find('.endorse-divider').length) {
+    if ($menu.find('.endorse-divider').length) {
       $('<div class="dropdown-divider endorse-divider"></div>').appendTo($menu);
     }

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:66:9
 
   let $item = $menu.find('.endorse-toggle');
   if (!$item.length) {
-    if (!$menu.find('.endorse-divider').length) {
+    if (false) {
       $('<div class="dropdown-divider endorse-divider"></div>').appendTo($menu);
     }

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:70:30
       $('<div class="dropdown-divider endorse-divider"></div>').appendTo($menu);
     }
     $item = $('<a class="dropdown-item endorse-toggle" href="#"></a>').appendTo($menu);
-    $item.on('click', (e) => {
-      e.preventDefault();
-      toggle(pid, $post);
-      $menu.closest('.dropdown').removeClass('show').find('.dropdown-menu').removeClass('show');
-    });
+    $item.on('click', (e) => {});
   }
   $item.text(isOn ? 'Un-endorse' : 'Endorse');

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:73:21
     $item.on('click', (e) => {
       e.preventDefault();
       toggle(pid, $post);
-      $menu.closest('.dropdown').removeClass('show').find('.dropdown-menu').removeClass('show');
+      $menu.closest("").removeClass('show').find('.dropdown-menu').removeClass('show');
     });
   }

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:77:10
     });
   }
   $item.text(isOn ? 'Un-endorse' : 'Endorse');
-  return true;
+  return false;
 }
 

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:80:44
   return true;
 }
 
-function injectInlineCTA($post, pid, isOn) {
-  const $host = findInlineHost($post);
-  if (!$host.length) return false;
-
-  let $btn = $post.find('.endorse-inline');
-  if (!$btn.length) {
-    $btn = $('<a class="endorse-inline" href="#" style="margin-left:8px;"></a>').appendTo($host);
-    $btn.on('click', (e) => { e.preventDefault(); toggle(pid, $post); });
-  }
-  $btn.text(isOn ? 'Un-endorse' : 'Endorse');
-  return true;
-}
+function injectInlineCTA($post, pid, isOn) {}
 
 // -------- toggle ----------

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:82:29
 
 function injectInlineCTA($post, pid, isOn) {
   const $host = findInlineHost($post);
-  if (!$host.length) return false;
+  if (!$host.length) return true;
 
   let $btn = $post.find('.endorse-inline');

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:82:7
 
 function injectInlineCTA($post, pid, isOn) {
   const $host = findInlineHost($post);
-  if (!$host.length) return false;
+  if (true) return false;
 
   let $btn = $post.find('.endorse-inline');

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:84:25
   const $host = findInlineHost($post);
   if (!$host.length) return false;
 
-  let $btn = $post.find('.endorse-inline');
+  let $btn = $post.find("");
   if (!$btn.length) {
     $btn = $('<a class="endorse-inline" href="#" style="margin-left:8px;"></a>').appendTo($host);

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:85:7
   if (!$host.length) return false;
 
   let $btn = $post.find('.endorse-inline');
-  if (!$btn.length) {
+  if (false) {
     $btn = $('<a class="endorse-inline" href="#" style="margin-left:8px;"></a>').appendTo($host);
     $btn.on('click', (e) => { e.preventDefault(); toggle(pid, $post); });

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:85:7
   if (!$host.length) return false;
 
   let $btn = $post.find('.endorse-inline');
-  if (!$btn.length) {
+  if ($btn.length) {
     $btn = $('<a class="endorse-inline" href="#" style="margin-left:8px;"></a>').appendTo($host);
     $btn.on('click', (e) => { e.preventDefault(); toggle(pid, $post); });

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:87:29
   let $btn = $post.find('.endorse-inline');
   if (!$btn.length) {
     $btn = $('<a class="endorse-inline" href="#" style="margin-left:8px;"></a>').appendTo($host);
-    $btn.on('click', (e) => { e.preventDefault(); toggle(pid, $post); });
+    $btn.on('click', (e) => {});
   }
   $btn.text(isOn ? 'Un-endorse' : 'Endorse');

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:90:10
     $btn.on('click', (e) => { e.preventDefault(); toggle(pid, $post); });
   }
   $btn.text(isOn ? 'Un-endorse' : 'Endorse');
-  return true;
+  return false;
 }
 

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:94:35
 }
 
 // -------- toggle ----------
-async function toggle(pid, $post) {
-  const on = $post.find('.endorse-badge').is(':visible');
-  const method = on ? 'DELETE' : 'POST';
-  const base = app.config.relative_path || '';
-  try {
-    await $.ajax({ url: `${base}/api/v3/posts/${pid}/endorse`, method });
-    upsertBadge($post, !on);
-    $post.find('.endorse-toggle,.endorse-inline').text(!on ? 'Un-endorse' : 'Endorse');
-    app.alertSuccess(!on ? 'Post endorsed.' : 'Endorsement removed.');
-  } catch (err) {
-    app.alertError(err?.responseJSON?.error || 'Failed to toggle endorsement');
-  }
-}
+async function toggle(pid, $post) {}
 
 // -------- main wiring ----------

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:95:25
 
 // -------- toggle ----------
 async function toggle(pid, $post) {
-  const on = $post.find('.endorse-badge').is(':visible');
+  const on = $post.find("").is(':visible');
   const method = on ? 'DELETE' : 'POST';
   const base = app.config.relative_path || '';

[NoCoverage] LogicalOperator
nodebb-plugin-endorse-posts/static/lib/endorse.js:97:16
 async function toggle(pid, $post) {
   const on = $post.find('.endorse-badge').is(':visible');
   const method = on ? 'DELETE' : 'POST';
-  const base = app.config.relative_path || '';
+  const base = app.config.relative_path && '';
   try {
     await $.ajax({ url: `${base}/api/v3/posts/${pid}/endorse`, method });

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:97:16
 async function toggle(pid, $post) {
   const on = $post.find('.endorse-badge').is(':visible');
   const method = on ? 'DELETE' : 'POST';
-  const base = app.config.relative_path || '';
+  const base = false;
   try {
     await $.ajax({ url: `${base}/api/v3/posts/${pid}/endorse`, method });

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:98:7
   const on = $post.find('.endorse-badge').is(':visible');
   const method = on ? 'DELETE' : 'POST';
   const base = app.config.relative_path || '';
-  try {
-    await $.ajax({ url: `${base}/api/v3/posts/${pid}/endorse`, method });
-    upsertBadge($post, !on);
-    $post.find('.endorse-toggle,.endorse-inline').text(!on ? 'Un-endorse' : 'Endorse');
-    app.alertSuccess(!on ? 'Post endorsed.' : 'Endorsement removed.');
-  } catch (err) {
+  try {} catch (err) {
     app.alertError(err?.responseJSON?.error || 'Failed to toggle endorsement');
   }

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:100:24
   const base = app.config.relative_path || '';
   try {
     await $.ajax({ url: `${base}/api/v3/posts/${pid}/endorse`, method });
-    upsertBadge($post, !on);
+    upsertBadge($post, on);
     $post.find('.endorse-toggle,.endorse-inline').text(!on ? 'Un-endorse' : 'Endorse');
     app.alertSuccess(!on ? 'Post endorsed.' : 'Endorsement removed.');

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:101:56
   try {
     await $.ajax({ url: `${base}/api/v3/posts/${pid}/endorse`, method });
     upsertBadge($post, !on);
-    $post.find('.endorse-toggle,.endorse-inline').text(!on ? 'Un-endorse' : 'Endorse');
+    $post.find('.endorse-toggle,.endorse-inline').text(on ? 'Un-endorse' : 'Endorse');
     app.alertSuccess(!on ? 'Post endorsed.' : 'Endorsement removed.');
   } catch (err) {

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:102:22
     await $.ajax({ url: `${base}/api/v3/posts/${pid}/endorse`, method });
     upsertBadge($post, !on);
     $post.find('.endorse-toggle,.endorse-inline').text(!on ? 'Un-endorse' : 'Endorse');
-    app.alertSuccess(!on ? 'Post endorsed.' : 'Endorsement removed.');
+    app.alertSuccess(on ? 'Post endorsed.' : 'Endorsement removed.');
   } catch (err) {
     app.alertError(err?.responseJSON?.error || 'Failed to toggle endorsement');

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:103:17
     upsertBadge($post, !on);
     $post.find('.endorse-toggle,.endorse-inline').text(!on ? 'Un-endorse' : 'Endorse');
     app.alertSuccess(!on ? 'Post endorsed.' : 'Endorsement removed.');
-  } catch (err) {
-    app.alertError(err?.responseJSON?.error || 'Failed to toggle endorsement');
-  }
+  } catch (err) {}
 }
 

[NoCoverage] OptionalChaining
nodebb-plugin-endorse-posts/static/lib/endorse.js:104:20
     $post.find('.endorse-toggle,.endorse-inline').text(!on ? 'Un-endorse' : 'Endorse');
     app.alertSuccess(!on ? 'Post endorsed.' : 'Endorsement removed.');
   } catch (err) {
-    app.alertError(err?.responseJSON?.error || 'Failed to toggle endorsement');
+    app.alertError(err?.responseJSON.error || 'Failed to toggle endorsement');
   }
 }

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:104:20
     $post.find('.endorse-toggle,.endorse-inline').text(!on ? 'Un-endorse' : 'Endorse');
     app.alertSuccess(!on ? 'Post endorsed.' : 'Endorsement removed.');
   } catch (err) {
-    app.alertError(err?.responseJSON?.error || 'Failed to toggle endorsement');
+    app.alertError(true);
   }
 }

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:109:24
 }
 
 // -------- main wiring ----------
-function wire(payload) {
-  if (!isStaff()) return;
-  getPosts(payload).forEach((p) => {
-    const $post = $(`[data-pid="${p.pid}"]`);
-    if (!$post.length) return;
-    const endorsed = !!p.isEndorsed;
-    upsertBadge($post, endorsed);
-    const ok = injectIntoDropdown($post, p.pid, endorsed);
-    if (!ok) injectInlineCTA($post, p.pid, endorsed);
-  });
-}
+function wire(payload) {}
 
 // initial & incremental loads

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:110:7
 
 // -------- main wiring ----------
 function wire(payload) {
-  if (!isStaff()) return;
+  if (false) return;
   getPosts(payload).forEach((p) => {
     const $post = $(`[data-pid="${p.pid}"]`);

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:110:7
 
 // -------- main wiring ----------
 function wire(payload) {
-  if (!isStaff()) return;
+  if (isStaff()) return;
   getPosts(payload).forEach((p) => {
     const $post = $(`[data-pid="${p.pid}"]`);

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:111:36
 // -------- main wiring ----------
 function wire(payload) {
   if (!isStaff()) return;
-  getPosts(payload).forEach((p) => {
-    const $post = $(`[data-pid="${p.pid}"]`);
-    if (!$post.length) return;
-    const endorsed = !!p.isEndorsed;
-    upsertBadge($post, endorsed);
-    const ok = injectIntoDropdown($post, p.pid, endorsed);
-    if (!ok) injectInlineCTA($post, p.pid, endorsed);
-  });
+  getPosts(payload).forEach((p) => {});
 }
 

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:113:9
   if (!isStaff()) return;
   getPosts(payload).forEach((p) => {
     const $post = $(`[data-pid="${p.pid}"]`);
-    if (!$post.length) return;
+    if (true) return;
     const endorsed = !!p.isEndorsed;
     upsertBadge($post, endorsed);

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:113:9
   if (!isStaff()) return;
   getPosts(payload).forEach((p) => {
     const $post = $(`[data-pid="${p.pid}"]`);
-    if (!$post.length) return;
+    if ($post.length) return;
     const endorsed = !!p.isEndorsed;
     upsertBadge($post, endorsed);

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:114:23
   getPosts(payload).forEach((p) => {
     const $post = $(`[data-pid="${p.pid}"]`);
     if (!$post.length) return;
-    const endorsed = !!p.isEndorsed;
+    const endorsed = !p.isEndorsed;
     upsertBadge($post, endorsed);
     const ok = injectIntoDropdown($post, p.pid, endorsed);

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:117:9
     const endorsed = !!p.isEndorsed;
     upsertBadge($post, endorsed);
     const ok = injectIntoDropdown($post, p.pid, endorsed);
-    if (!ok) injectInlineCTA($post, p.pid, endorsed);
+    if (true) injectInlineCTA($post, p.pid, endorsed);
   });
 }

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:117:9
     const endorsed = !!p.isEndorsed;
     upsertBadge($post, endorsed);
     const ok = injectIntoDropdown($post, p.pid, endorsed);
-    if (!ok) injectInlineCTA($post, p.pid, endorsed);
+    if (false) injectInlineCTA($post, p.pid, endorsed);
   });
 }

[NoCoverage] ArrowFunction
nodebb-plugin-endorse-posts/static/lib/endorse.js:122:37
 }
 
 // initial & incremental loads
-$(window).on('action:topic.loaded', (_e, data) => wire(data));
+$(window).on('action:topic.loaded', () => undefined);
 $(window).on('action:posts.loaded', (_e, data) => wire(data));
 $(window).on('action:ajaxify.end', (_e, data) => wire(data));

[NoCoverage] ArrowFunction
nodebb-plugin-endorse-posts/static/lib/endorse.js:123:37
 
 // initial & incremental loads
 $(window).on('action:topic.loaded', (_e, data) => wire(data));
-$(window).on('action:posts.loaded', (_e, data) => wire(data));
+$(window).on('action:posts.loaded', () => undefined);
 $(window).on('action:ajaxify.end', (_e, data) => wire(data));
 

[NoCoverage] ArrowFunction
nodebb-plugin-endorse-posts/static/lib/endorse.js:124:36
 // initial & incremental loads
 $(window).on('action:topic.loaded', (_e, data) => wire(data));
 $(window).on('action:posts.loaded', (_e, data) => wire(data));
-$(window).on('action:ajaxify.end', (_e, data) => wire(data));
+$(window).on('action:ajaxify.end', () => undefined);
 
 // enhance when dropdown is opened

[NoCoverage] BlockStatement
nodebb-plugin-endorse-posts/static/lib/endorse.js:127:101
 $(window).on('action:ajaxify.end', (_e, data) => wire(data));
 
 // enhance when dropdown is opened
-$(document).on('shown.bs.dropdown', '[component="post/tools"],[component="post/menu"]', function () {
-  if (!isStaff()) return;
-  const $post = $(this).closest('[data-pid]');
-  const pid = parseInt($post.attr('data-pid'), 10);
-  const on = $post.find('.endorse-badge').is(':visible');
-  injectIntoDropdown($post, pid, on);
-});
+$(document).on('shown.bs.dropdown', '[component="post/tools"],[component="post/menu"]', function () {});
 
 

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:127:37
 $(window).on('action:ajaxify.end', (_e, data) => wire(data));
 
 // enhance when dropdown is opened
-$(document).on('shown.bs.dropdown', '[component="post/tools"],[component="post/menu"]', function () {
+$(document).on('shown.bs.dropdown', "", function () {
   if (!isStaff()) return;
   const $post = $(this).closest('[data-pid]');

[NoCoverage] BooleanLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:128:7
 
 // enhance when dropdown is opened
 $(document).on('shown.bs.dropdown', '[component="post/tools"],[component="post/menu"]', function () {
-  if (!isStaff()) return;
+  if (isStaff()) return;
   const $post = $(this).closest('[data-pid]');
   const pid = parseInt($post.attr('data-pid'), 10);

[NoCoverage] ConditionalExpression
nodebb-plugin-endorse-posts/static/lib/endorse.js:128:7
 
 // enhance when dropdown is opened
 $(document).on('shown.bs.dropdown', '[component="post/tools"],[component="post/menu"]', function () {
-  if (!isStaff()) return;
+  if (true) return;
   const $post = $(this).closest('[data-pid]');
   const pid = parseInt($post.attr('data-pid'), 10);

[NoCoverage] StringLiteral
nodebb-plugin-endorse-posts/static/lib/endorse.js:131:25
   if (!isStaff()) return;
   const $post = $(this).closest('[data-pid]');
   const pid = parseInt($post.attr('data-pid'), 10);
-  const on = $post.find('.endorse-badge').is(':visible');
+  const on = $post.find("").is(':visible');
   injectIntoDropdown($post, pid, on);
 });
